### Operating on Data in Pandas

Ufuncs: (universal function )Index Preservation

In [1]:
import pandas as pd 
import numpy as np

In [2]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    6
1    3
2    7
3    4
dtype: int64

In [177]:
df = pd.DataFrame(rng.randint(0, 10, (3, 4)),columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  9  3  5  1
1  9  1  9  3
2  7  6  8  7

In [4]:
np.exp(ser) # chuyen sang numpy giu nguyen index

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [5]:
np.sin(df * np.pi / 4)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

uFuncs (unviersal function)  : index alignment (chi so sap xep)

In [10]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')
print (area)
print(population)

Alaska        1723337
Texas          695662
California     423967
Name: area, dtype: int64
California    38332521
Texas         26448193
New York      19651127
Name: population, dtype: int64

In [17]:
population / area  # lay gia ung vs chi so chung chia so nhau, neu ko co thi se la NaN

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [18]:
area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [21]:
A = pd.Series([2, 4, 6], index=[0, 1, 2]) #chi lay nhung cai giao cua 2 tap hop
B = pd.Series([1, 3, 5], index=[1, 2, 3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [22]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

### Index alignment in DataFrame

In [23]:
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),
                 columns=list('AB'))
A

    A   B
0   0  11
1  11  16

In [25]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)),
                 columns=list('BAC'))
B

   B  A  C
0  9  2  6
1  3  8  2
2  4  2  6

In [27]:
A + B

      A     B   C
0   2.0  20.0 NaN
1  19.0  19.0 NaN
2   NaN   NaN NaN

In [28]:
fill = A.stack().mean()
A.add(B, fill_value=fill)

      A     B     C
0   2.0  20.0  15.5
1  19.0  19.0  11.5
2  11.5  13.5  15.5

### Operations Between DataFrame and Series

In [30]:
A = rng.randint(10, size=(3, 4))
A

array([[4, 8, 6, 1],
       [3, 8, 1, 9],
       [8, 9, 4, 1]])

In [31]:
A - A[0] # tru di phan tu 0

array([[ 0,  0,  0,  0],
       [-1,  0, -5,  8],
       [ 4,  1, -2,  0]])

In [179]:
df = pd.DataFrame(A, columns=list('QRST'))
df - df.iloc[0]
#print(df.iloc[0])

   Q  R  S  T
0  0  0  0  0
1 -1  0 -5  8
2  4  1 -2  0

In [33]:
df.subtract(df['R'], axis=0)

df

   Q  R  S  T
0  4  8  6  1
1  3  8  1  9
2  8  9  4  1

In [35]:
halfrow = df.iloc[0, ::2]
halfrow

Q    4
S    6
Name: 0, dtype: int64

In [36]:
df - halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1 -1.0 NaN -5.0 NaN
2  4.0 NaN -2.0 NaN

### Handling Missing Data

In [ ]:
import numpy as np 
import pandas as pd

In [39]:
val1 = np.array([1,None,2 ,3 ,4])
val1

array([1, None, 2, 3, 4], dtype=object)

In [41]:
for dtype in ['object', 'int']: 
    print ('dtype =', dtype)
    %timeit np.arange(1E6, dtype=dtype).sum()
    print()

dtype = object
10 loops, best of 3: 55.1 ms per loop

dtype = int
1000 loops, best of 3: 1.75 ms per loop

In [42]:
val1.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

In [44]:
val2 = np.array([1,np.nan, 3, 4])
val2.dtype

dtype('float64')

In [45]:
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int64

In [46]:
x[0] = None
x

0    NaN
1    1.0
dtype: float64

###  Operating on Null Values

In [47]:
data = pd.Series([1, np.nan, 'hello', None])

In [48]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [49]:
data[data.notnull()]

0        1
2    hello
dtype: object

###  Dropping null values

In [50]:
data.dropna()

0        1
2    hello
dtype: object

In [51]:
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [52]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [53]:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [54]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [72]:
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [75]:
df.dropna(axis='rows', thresh=3) # gia tri toi thieu non nll values tren rows

     0    1  2   3
1  2.0  3.0  5 NaN

###  FIlling null values

In [76]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [77]:
data.fillna(0) # do dl nan = 0

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [78]:
# forward-fill
data.fillna(method='ffill') #do dl tu trc do ra phia sau

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [79]:
data.fillna(method='bfill') # do dl ra phia duoi

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [80]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [83]:
df.fillna(method='ffill', axis =1 ) # axis 1 theo rows do dl tu trai qua phai vs cell = Nan
# axis = 0 theo col 
# trc do ko co dl thi cell NaN not change

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

##  Hierarchical Indexing

dịch là thứ bậc index 
đưa dữ liệu ở chiều cao hơn 3d,4d chuyển về series and dataframe
chúng ta sẽ phân tách, lập chỉ mục, thông kê

In [84]:
import pandas as pd 
import numpy as np

In [86]:
#A Multiply Indexed Series

In [87]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [93]:
#print(type(index))
pop[[i for i in pop.index if i[1] == 2010]]

California  2010    37253956
New York    2010    19378102
Texas       2010    25145561
dtype: int64

###  The Better Way: Pandas MultiIndex

In [89]:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [90]:
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [91]:
pop[:, 2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

### MultiIndex as extra dimension

In [94]:
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [95]:
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [96]:
pop_df = pd.DataFrame({'total': pop,
                       'under18': [9267089, 9284094,
                                   4687374, 4318033,
                                   5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [97]:
f_u18 = pop_df['under18'] / pop_df['total']
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

### Methods of MultiIndex Creation

In [98]:
df = pd.DataFrame(np.random.rand(4, 2),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=['data1', 'data2'])
df

        data1     data2
a 1  0.141101  0.642542
  2  0.027018  0.305402
b 1  0.035584  0.192008
  2  0.507141  0.599563

In [99]:
data = {('California', 2000): 33871648,
        ('California', 2010): 37253956,
        ('Texas', 2000): 20851820,
        ('Texas', 2010): 25145561,
        ('New York', 2000): 18976457,
        ('New York', 2010): 19378102}
pd.Series(data)

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

### Explicit MultiIndex constructors

In [100]:
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1, 2, 1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [103]:
pd.MultiIndex.from_product([['a', 'b'], [1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [104]:
pd.MultiIndex(levels=[['a', 'b'], [1, 2]],
              labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

TypeError: __new__() got an unexpected keyword argument 'labels'

### MultiIndex level names

In [105]:
pop.index.names = ['state', 'year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

### MultiIndex for columns

In [106]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                     names=['subject', 'type'])

# mock some data
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37

# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      31.0  36.8  47.0  35.8  35.0  36.8
     2      29.0  37.8  21.0  37.0  12.0  37.9
2014 1      34.0  36.4  17.0  37.1  46.0  38.4
     2      34.0  36.6  38.0  37.0  50.0  36.4

In [107]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      47.0  35.8
     2      21.0  37.0
2014 1      17.0  37.1
     2      38.0  37.0

## Indexing and Slicing a MultiIndex

Multiply indexed Series

In [108]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [113]:
pop['California',2000]

33871648

In [119]:
pop.loc['California':'New York'] # cho phep slicing theo name col

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [126]:
pop[1:2] # bt lay theo index

state       year
California  2010    37253956
dtype: int64

In [132]:
 pop[ : ,2000] # lay theo nam

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [133]:
pop[pop > 22000000]# lay theo condition values >

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [134]:
pop[['California', 'Texas']]

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

###  Multiply indexed DataFrames

In [135]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      31.0  36.8  47.0  35.8  35.0  36.8
     2      29.0  37.8  21.0  37.0  12.0  37.9
2014 1      34.0  36.4  17.0  37.1  46.0  38.4
     2      34.0  36.6  38.0  37.0  50.0  36.4

In [136]:
health_data['Guido', 'HR'] # chi dich danh col can lay

year  visit
2013  1        47.0
      2        21.0
2014  1        17.0
      2        38.0
Name: (Guido, HR), dtype: float64

In [155]:
print (health_data.iloc[:2, :]) # lay theo index)
print (health_data.iloc[:, :2])# lay theo row)

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      31.0  36.8  47.0  35.8  35.0  36.8
     2      29.0  37.8  21.0  37.0  12.0  37.9
subject      Bob
type          HR  Temp
year visit
2013 1      31.0  36.8
     2      29.0  37.8
2014 1      34.0  36.4
     2      34.0  36.6

In [182]:
health_data.loc[(:), (:,:)]
# errow khi dung loc

SyntaxError: invalid syntax (<ipython-input-182-1757f186a90a>, line 1)

In [157]:
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      31.0  47.0  35.0
2014 1      34.0  17.0  46.0

## Rearranging Multi-Indices

Sorted and unsorted indices

In [158]:
index = pd.MultiIndex.from_product([['a', 'c', 'b'], [1, 2]])
data = pd.Series(np.random.rand(6), index=index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.951158
      2      0.399716
c     1      0.321491
      2      0.128695
b     1      0.309083
      2      0.924878
dtype: float64

In [160]:
try:
    data['a':'b']
except KeyError as e:
    print(type(e))
    print(e)

<class 'pandas.errors.UnsortedIndexError'>
'Key length (1) was greater than MultiIndex lexsort depth (0)'

In [161]:
data = data.sort_index()
data

char  int
a     1      0.951158
      2      0.399716
b     1      0.309083
      2      0.924878
c     1      0.321491
      2      0.128695
dtype: float64

In [162]:
data['a':'b']

char  int
a     1      0.951158
      2      0.399716
b     1      0.309083
      2      0.924878
dtype: float64

### Stacking and unstacking indices

In [163]:
pop.unstack(level=0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [164]:
pop.unstack(level=1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [165]:
pop.unstack().stack()

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [170]:
pop_flat = pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [171]:
pop_flat.set_index(['state', 'year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

In [173]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      31.0  36.8  47.0  35.8  35.0  36.8
     2      29.0  37.8  21.0  37.0  12.0  37.9
2014 1      34.0  36.4  17.0  37.1  46.0  38.4
     2      34.0  36.6  38.0  37.0  50.0  36.4

In [174]:
data_mean = health_data.mean(level='year')
data_mean

subject   Bob       Guido          Sue
type       HR  Temp    HR   Temp    HR   Temp
year
2013     30.0  37.3  34.0  36.40  23.5  37.35
2014     34.0  36.5  27.5  37.05  48.0  37.40

In [175]:
data_mean.mean(axis=1, level='type')

type         HR       Temp
year
2013  29.166667  37.016667
2014  36.500000  36.983333

## Aside: Panel Data